# Pyber Challenge

### 4.3 Loading and Reading CSV files

In [1]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd

# To get the number of rides(ride_id) grouped by type of city, we need to merge the two dataframses.
# merge different data sets import the os module with the dependencies

import os

# File to Load (Remember to change these)- changed
city_data_path = 'Resources/city_data.csv'
ride_data_path = 'Resources/ride_data.csv'

In [2]:
# Read the City Data
city_data_df = pd.read_csv(city_data_path)
city_data_df.head()

           city  driver_count   type
0   Richardfort            38  Urban
1  Williamsstad            59  Urban
2   Port Angela            67  Urban
3    Rodneyfort            34  Urban
4   West Robert            39  Urban

In [3]:
# Read the Ride Data
ride_data_df = pd.read_csv(ride_data_path)
ride_data_df.head()

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344

In [4]:
# Before analysing the data it needs to be wrangled (cleaned, munged)
# Inspect and or clean up the City & Ride Data DataFrame 
# Get the columns and rows that are not null
# Check to confirm the correct data type is being used
# Get all the rows that contain null values by getting rows that are not null.df.count() or df.isnull().sum() method) 
# Findout number of data points for each city type.

In [5]:
# Get the columns and the rows that are not null. (All counts at 120 so no missing values, clean data set)
city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [6]:
# Confirm the data type (Datatypes are ok)
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [7]:
# Get all the rows that contain null values (no null values so ok)
city_data_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [8]:
# Get the columns and the rows that are not null.(All counts at 2375 so no missing values, clean data set)
ride_data_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [9]:
# Confirm the data type (date is object type so best to clean it up before merging the data or analysing it)
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [10]:
# Get all the rows that contain null values (no null values so ok)
ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [11]:
## convert datetime column to just date using normalize()
# method
ride_data_df['date']=pd.to_datetime(ride_data_df['date']).dt.normalize()

In [12]:
# Recheck the data type (date has been changed from object type to date type)
ride_data_df.dtypes

city               object
date       datetime64[ns]
fare              float64
ride_id             int64
dtype: object

### Merge the DataFrames

In [13]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the data table for preview
pyber_data_df.head()

                 city       date   fare        ride_id  driver_count   type
0  Lake Jonathanshire 2019-01-14  13.83  5739410935873             5  Urban
1  South Michelleport 2019-03-04  30.24  2343912425577            72  Urban
2  Port Samanthamouth 2019-02-24  33.44  2005065760003            57  Urban
3          Rodneyfort 2019-02-10  23.44  5149245426178            34  Urban
4          South Jack 2019-03-06  34.58  3908451377344            46  Urban

In [14]:
# Confirm the data types  (date data type may need to be changed to datetime)
pyber_data_df.dtypes

city                    object
date            datetime64[ns]
fare                   float64
ride_id                  int64
driver_count             int64
type                    object
dtype: object

In [15]:
#  To get the total rides for each city type first group by type of city - Get the unique values of the different types of city so as to create define these variables(types of cities)
city_data_df["type"].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [16]:
# create type of city dataframes - Urban Cities DF
urban_cities_df = pyber_data_df[pyber_data_df["type"] == "Urban"]
urban_cities_df.head()

                 city       date   fare        ride_id  driver_count   type
0  Lake Jonathanshire 2019-01-14  13.83  5739410935873             5  Urban
1  South Michelleport 2019-03-04  30.24  2343912425577            72  Urban
2  Port Samanthamouth 2019-02-24  33.44  2005065760003            57  Urban
3          Rodneyfort 2019-02-10  23.44  5149245426178            34  Urban
4          South Jack 2019-03-06  34.58  3908451377344            46  Urban

In [17]:
# create type of city dataframes - Suburban Cities DF
suburban_cities_df = pyber_data_df[pyber_data_df["type"]=="Suburban"]
suburban_cities_df.head()

               city       date   fare        ride_id  driver_count      type
1625  Barronchester 2019-01-27  27.79  6653622887913            11  Suburban
1626  East Kentstad 2019-04-07  18.75  6575961095852            20  Suburban
1627      Lake Omar 2019-01-17  21.71   966911700371            22  Suburban
1628     Myersshire 2019-02-27  17.10  5706770909868            19  Suburban
1629    West Hannah 2019-04-19  37.78  2273047151891            12  Suburban

In [18]:
# create type of city dataframes - Rural Cities DF
rural_cities_df = pyber_data_df[pyber_data_df["type"]=="Rural"]
rural_cities_df.head()

                 city       date   fare        ride_id  driver_count   type
2250   Randallchester 2019-04-13  43.22  1076079536213             9  Rural
2251      North Holly 2019-02-02  12.42  1985256326182             8  Rural
2252      Michaelberg 2019-03-27  54.85  4421836952718             6  Rural
2253  Lake Latoyabury 2019-02-23  47.90  3269652929887             2  Rural
2254  Lake Latoyabury 2019-05-06  51.80  4018025271936             2  Rural

## Deliverable 1: Get a Summary DataFrame

In [19]:
#  1. Get the total rides for each city type

In [20]:
# Total Rides Count for each city type
type_rides_count = pyber_data_df.groupby(["type"]).count()["ride_id"]
type_rides_count

type
Rural        125
Suburban     625
Urban       1625
Name: ride_id, dtype: int64

In [21]:
# Get the number of rides for each urban city.
urban_ride_count = urban_cities_df.groupby(["city"]).count()["ride_id"]
urban_ride_count.head()

city
Amandaburgh        18
Barajasview        22
Carriemouth        27
Christopherfurt    27
Deanville          19
Name: ride_id, dtype: int64

In [22]:
# Get the number of rides for each Suburban city.
suburban_ride_count = suburban_cities_df.groupby(["city"]).count()["ride_id"]
suburban_ride_count.head()

city
Barronchester    16
Bethanyland      18
Brandonfort      19
Colemanland      22
Davidfurt        17
Name: ride_id, dtype: int64

In [23]:
# Get the number of rides for each Rural city.
rural_ride_count = rural_cities_df.groupby(["city"]).count()["ride_id"]
rural_ride_count.head()

city
Bradshawfurt      10
Garzaport          3
Harringtonfort     6
Jessicaport        6
Lake Jamie         6
Name: ride_id, dtype: int64

In [24]:
# 2. Get the total drivers for each city type

In [25]:
# Total number of drivers for each city type
type_total_drivers = city_data_df.groupby(["type"]).sum()["driver_count"]
type_total_drivers.head()

type
Rural         78
Suburban     490
Urban       2405
Name: driver_count, dtype: int64

In [26]:
# Get the total number of drivers for each urban city.
urban_driver_count = urban_cities_df.groupby(["city"]).sum()["driver_count"]
urban_driver_count.head()

city
Amandaburgh         216
Barajasview         572
Carriemouth        1404
Christopherfurt    1107
Deanville           931
Name: driver_count, dtype: int64

In [27]:
urban_driver_count.sum()

59602

In [28]:
# Get the total number of drivers for each Suburban city.
suburban_driver_count = suburban_cities_df.groupby(["city"]).sum()["driver_count"]
suburban_driver_count.head()

city
Barronchester    176
Bethanyland      396
Brandonfort      190
Colemanland      506
Davidfurt        391
Name: driver_count, dtype: int64

In [29]:
suburban_driver_count.sum()

8570

In [30]:
# Get the total number of drivers for each rural city.
rural_driver_count = rural_cities_df.groupby(["city"]).sum()["driver_count"]
rural_driver_count.head()

city
Bradshawfurt      70
Garzaport         21
Harringtonfort    24
Jessicaport        6
Lake Jamie        24
Name: driver_count, dtype: int64

In [31]:
rural_driver_count.sum()

537

In [32]:
#  3. Get the total amount of fares for each city type

In [33]:
#  3. Get the total amount of fares for each city type
# Use the sum function to get the total number of fares for each city type

In [34]:
type_total_fare = pyber_data_df.groupby(["type"]).sum()["fare"]
type_total_fare.head()

type
Rural        4327.93
Suburban    19356.33
Urban       39854.38
Name: fare, dtype: float64

In [35]:
# Get the total amount of fares for Urban cities.
urban_total_fare = urban_cities_df.groupby(["city"]).sum()["fare"]
urban_total_fare.head()

city
Amandaburgh        443.55
Barajasview        557.31
Carriemouth        764.49
Christopherfurt    661.55
Deanville          491.01
Name: fare, dtype: float64

In [36]:
# Get the total amount of fares for Suburban cities
suburban_total_fare = suburban_cities_df.groupby(["city"]).sum()["fare"]
suburban_total_fare.head()

city
Barronchester    582.76
Bethanyland      593.21
Brandonfort      673.31
Colemanland      679.68
Davidfurt        543.93
Name: fare, dtype: float64

In [37]:
# Get the total amount of fares for Rural cities
rural_total_fare = rural_cities_df.groupby(["city"]).sum()["fare"]
rural_total_fare.head()

city
Bradshawfurt      400.64
Garzaport          72.37
Harringtonfort    200.82
Jessicaport       216.08
Lake Jamie        206.15
Name: fare, dtype: float64

In [38]:
#  4. Get the average fare per ride for each city type.

In [39]:
# Average fare per ride is total fare / no of rides - simplifies apply the mean function formula to get the same result

In [40]:
type_avg_fare = pyber_data_df.groupby(["type"]).mean()["fare"]
type_avg_fare.head()

type
Rural       34.623440
Suburban    30.970128
Urban       24.525772
Name: fare, dtype: float64

In [41]:
# Get average fare for each Urban city.
urban_avg_fare = urban_cities_df.groupby(["city"]).mean()["fare"]
urban_avg_fare.head()

city
Amandaburgh        24.641667
Barajasview        25.332273
Carriemouth        28.314444
Christopherfurt    24.501852
Deanville          25.842632
Name: fare, dtype: float64

In [42]:
urban_avg_fare.mean()

24.499121716787847

In [43]:
# Get average fare for each Suburban city.
suburban_avg_fare = suburban_cities_df.groupby(["city"]).mean()["fare"]
suburban_avg_fare.head()

city
Barronchester    36.422500
Bethanyland      32.956111
Brandonfort      35.437368
Colemanland      30.894545
Davidfurt        31.995882
Name: fare, dtype: float64

In [44]:
suburban_avg_fare.mean()

30.737298033475952

In [45]:
# Get average fare for each city rural city.
rural_avg_fare = rural_cities_df.groupby(["city"]).mean()["fare"]
rural_avg_fare.head()

city
Bradshawfurt      40.064000
Garzaport         24.123333
Harringtonfort    33.470000
Jessicaport       36.013333
Lake Jamie        34.358333
Name: fare, dtype: float64

In [46]:
rural_avg_fare.mean()

34.63776503126503

In [47]:
# 5. Get the average fare per driver for each city type.

In [48]:
# 5. Get the average fare per driver for each city type i.e.sun of fare per city type / numnber of drivers per city type

In [49]:
avg_fare_per_driver_per_city =  pyber_data_df.groupby(["type"]).sum()["fare"]/city_data_df.groupby(["type"]).sum()["driver_count"]
avg_fare_per_driver_per_city.head()

type
Rural       55.486282
Suburban    39.502714
Urban       16.571468
dtype: float64

In [50]:
#  6. Create a PyBer summary DataFrame.

In [51]:
pyber_summary_df=pd.DataFrame(
    { "Total Rides": type_rides_count,
      "Total Drivers": type_total_drivers,
      "Total Fares": type_total_fare,
      "Average Fare per Ride": type_avg_fare,
      "Average Fare per Driver": avg_fare_per_driver_per_city})

In [52]:
# Print Data Frame
pyber_summary_df

,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average Fare per Driver
type,,,,,
Rural,125,78,4327.93,34.623440,55.486282
Suburban,625,490,19356.33,30.970128,39.502714
Urban,1625,2405,39854.38,24.525772,16.571468

In [53]:
#  7. Cleaning up the DataFrame. Delete the index name
pyber_summary_df.index.name = None
pyber_summary_df

,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average Fare per Driver
Rural,125,78,4327.93,34.623440,55.486282
Suburban,625,490,19356.33,30.970128,39.502714
Urban,1625,2405,39854.38,24.525772,16.571468

In [54]:
#  8. Format the columns.

In [55]:
# Add , to total rides and total drivers and $ to Total fares, Average fare/ride and average fare/driver
pyber_summary_df["Total Rides"] = pyber_summary_df["Total Rides"].map("{:,}".format)
pyber_summary_df["Total Drivers"] = pyber_summary_df["Total Drivers"].map("{:,}".format)
pyber_summary_df["Total Fares"] = pyber_summary_df["Total Fares"].map("${:,.2f}".format)
pyber_summary_df["Average Fare per Ride"] = pyber_summary_df["Average Fare per Ride"].map("${:,.2f}".format)
pyber_summary_df["Average Fare per Driver"] = pyber_summary_df["Average Fare per Driver"].map("${:,.2f}".format)

# print formatting
pyber_summary_df

,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average Fare per Driver
Rural,125,78,"$4,327.93",$34.62,$55.49
Suburban,625,490,"$19,356.33",$30.97,$39.50
Urban,"1,625","2,405","$39,854.38",$24.53,$16.57

## Deliverable 2.  Create a multiple line plot that shows the total weekly of the fares for each type of city.

In [56]:
# 1. Read the merged DataFrame
pyber_data_df.head()

                 city       date   fare        ride_id  driver_count   type
0  Lake Jonathanshire 2019-01-14  13.83  5739410935873             5  Urban
1  South Michelleport 2019-03-04  30.24  2343912425577            72  Urban
2  Port Samanthamouth 2019-02-24  33.44  2005065760003            57  Urban
3          Rodneyfort 2019-02-10  23.44  5149245426178            34  Urban
4          South Jack 2019-03-06  34.58  3908451377344            46  Urban

In [57]:
# 2. Using groupby() to create a new DataFrame showing the sum of the fares 
#  for each date where the indices are the city type and date.

In [58]:
date_type_df = pyber_data_df.groupby(["date", "type"]).sum()["fare"]
date_type_df

date        type
2019-01-01  Rural        43.69
            Suburban    128.52
            Urban       127.78
2019-01-02  Rural        52.12
            Suburban    274.92
                         ...
2019-05-06  Urban       181.20
2019-05-07  Rural        44.94
            Suburban    274.09
            Urban       258.01
2019-05-08  Urban       170.82
Name: fare, Length: 334, dtype: float64

In [59]:
# 3. Reset the index on the DataFrame you created in #1. This is needed to use the 'pivot()' function.
# df = df.reset_index()
date_type_df = date_type_df.reset_index()
date_type_df

          date      type    fare
0   2019-01-01     Rural   43.69
1   2019-01-01  Suburban  128.52
2   2019-01-01     Urban  127.78
3   2019-01-02     Rural   52.12
4   2019-01-02  Suburban  274.92
..         ...       ...     ...
329 2019-05-06     Urban  181.20
330 2019-05-07     Rural   44.94
331 2019-05-07  Suburban  274.09
332 2019-05-07     Urban  258.01
333 2019-05-08     Urban  170.82

[334 rows x 3 columns]

In [60]:
# Check the data types
date_type_df.dtypes

date    datetime64[ns]
type            object
fare           float64
dtype: object

In [61]:
# 4. Create a pivot table with the 'date' as the index, the columns ='type', and values='fare' 
# to get the total fares for each type of city by the date.

In [62]:
date_type_pivot = date_type_df.pivot(index="date", columns="type", values="fare")
date_type_pivot.head()

type        Rural  Suburban   Urban
date
2019-01-01  43.69    128.52  127.78
2019-01-02  52.12    274.92  305.99
2019-01-03  19.90    133.48  260.48
2019-01-04  24.88     20.69  258.14
2019-01-05    NaN    101.36  506.89

In [63]:
# 5. Create a new DataFrame from the pivot table DataFrame using loc on the given dates, '2019-01-01':'2019-04-29'.
loc_date_type_pivot = date_type_pivot.loc['2019-01-01':'2019-04-29']
loc_date_type_pivot.head()

type        Rural  Suburban   Urban
date
2019-01-01  43.69    128.52  127.78
2019-01-02  52.12    274.92  305.99
2019-01-03  19.90    133.48  260.48
2019-01-04  24.88     20.69  258.14
2019-01-05    NaN    101.36  506.89

In [64]:
# 6. Set the "date" index to datetime datatype. This is necessary to use the resample() method in Step 8.
# df.index = pd.to_datetime(df.index)
loc_date_type_pivot_index = pd.to_datetime(loc_date_type_pivot.index)
loc_date_type_pivot_index

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10',
               ...
               '2019-04-20', '2019-04-21', '2019-04-22', '2019-04-23',
               '2019-04-24', '2019-04-25', '2019-04-26', '2019-04-27',
               '2019-04-28', '2019-04-29'],
              dtype='datetime64[ns]', name='date', length=119, freq=None)

In [65]:
# 7. Check that the datatype for the index is datetime using df.info()
loc_date_type_pivot.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 119 entries, 2019-01-01 to 2019-04-29
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Rural     74 non-null     float64
 1   Suburban  118 non-null    float64
 2   Urban     119 non-null    float64
dtypes: float64(3)
memory usage: 3.7 KB

In [66]:
# 8. Create a new DataFrame using the "resample()" function by week 'W' and get the sum of the fares for each week.
# resample by week to get sum of fares for each week i.e. find the weekly fare for the period '2019-01-01':'2019-04-29'.
loc_date_type_pivot_res=loc_date_type_pivot.resample('W').sum()
loc_date_type_pivot_res.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 18 entries, 2019-01-06 to 2019-05-05
Freq: W-SUN
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Rural     18 non-null     float64
 1   Suburban  18 non-null     float64
 2   Urban     18 non-null     float64
dtypes: float64(3)
memory usage: 576.0 bytes

In [67]:
# 8. Using the object-oriented interface method, plot the resample DataFrame using the df.plot() function. 
# Import the style from Matplotlib.
from matplotlib import style
# Use the graph style fivethirtyeight.
style.use('fivethirtyeight')